; domain
(define (domain robot-rover)
      (:requirements :typing)
      (:types robot location state - object
               empty mineral lab - state)
      
      (:predicates
           (there_a_mineral ?rock - mineral ?field - location)
	   (there_a_lab ?lab - laboratory ?field - location)
	   (rover_is_charged ?rock - mineral ?r - robot)	  
	   (at ?r - robot ?field - location)
           (move ?from - location ?to - location)
           (clear ?c - empty ?from - location)
           (valid_move ?from ?to - location)
      )
      
      (:action valid_empty_location
       :parameters (?r - robot ?from ?to - location ?m - mineral ?la - lab ?e - empty)
       :precondition
                    (and 
                        (at ?r ?from)
                        (not (and (there_a_mineral ?m ?l) (there_a_lab ?lab ?la)))
                        (clear ?e ?l)
                    )
                    :effect(
                        and
                           (valid_move ?from ?to)
                           (at ?r ?from)
      		    )
	)
	
      (:action move_to_other_location
       :parameters (?r - robot ?from ?to - location)
       :precondition
                    (and 
                        (at ?r ?from)
                         (valid_move ?from ?to)
                    )
                    :effect(
                        and
                           (move ?from ?to)
                           (not(at ?r ?from))
                           (at ?r ?to)
      		    )
	)   
	
      (:action mineral_found
       :parameters (?r - robot ?from ?to - location ?m - mineral ?e - empty)
       :precondition
                    (and 
                        (at ?r ?from)
                        (there_a_mineral ?m ?from)
                        (valid_move ?from ?to)
                        (not (rover_is_charged ?m ?r))
                    )
                    :effect(
                        and
                           (rover_is_charged ?m ?r)
                           (not (there_a_mineral ?m ?from))
                           (clear ?e ?from)
      		    )
	)  
	
      (:action mineral_charged
       :parameters (?r - robot ?from ?to - location ?m - mineral)
       :precondition
                    (and 
                        (at ?r ?from)
                        (there_a_mineral ?m ?from)
                        (valid_move ?from ?to)
                        (rover_is_charged ?m ?r)
                    )
                    :effect(
                        and
                           (there_a_mineral ?m ?from)
                           (at ?r ?from)
      		    )
      )
	
      (:action mineral_discharge
       :parameters (?r - robot ?from ?to - location ?m - mineral ?l - lab)
       :precondition
                    (and 
                        (at ?r ?from)
                        (there_a_lab ?l ?from)
                        (valid_move ?from ?to)
                        (rover_is_charged ?m ?r)
                    )
                    :effect(
                        and
                           (not(rover_is_charged ?m ?r))
                           (there_a_mineral ?m ?from)
      		    )
	)  
	
)

; problem
(define (problem rover-the-robot-initial-prob)
(:domain robot-rover)
(:objects
    yellowrock greenrock - mineral
    lab1 - lab
    roverobot - robot
    L1 L2 L3 L4 L5 - location
    emp - empty
)
(:init		  
	        (there_a_mineral yellowrock L1)
		(there_a_mineral greenrock L2)
		(there_a_lab lab1 L5)	
		(at roverobot L4)
		(clear emp L4)
		(clear emp L3)
		(valid_move L4 L3)
		(valid_move L3 L4)
		(valid_move L4 L5)
		(valid_move L5 L4)
		(valid_move L2 L4)
		(valid_move L3 L2)
		(valid_move L1 L3)
		(valid_move L3 L1)
)
(:goal
(and
        
	(there_a_mineral yellowrock L5)
	(there_a_mineral greenrock L5)
        (at roverobot L5)
)       
)
)

; plan
1. (move_to_other_location roverobot l4 l3)
   deleted: (at roverobot l4)
   added: (move l4 l3) (at roverobot l3)
   goals met: 0 of 3
2. (move_to_other_location roverobot l3 l1)
   deleted: (at roverobot l3)
   added: (move l3 l1) (at roverobot l1)
   goals met: 0 of 3
3. (mineral_found roverobot l1 l3 yellowrock emp)
   deleted: (there_a_mineral yellowrock l1)
   added: (rover_is_charged yellowrock roverobot) (clear emp l1)
   goals met: 0 of 3
4. (move_to_other_location roverobot l1 l3)
   deleted: (at roverobot l1)
   added: (move l1 l3) (at roverobot l3)
   goals met: 0 of 3
5. (move_to_other_location roverobot l3 l2)
   deleted: (at roverobot l3)
   added: (move l3 l2) (at roverobot l2)
   goals met: 0 of 3
6. (mineral_found roverobot l2 l4 greenrock emp)
   deleted: (there_a_mineral greenrock l2)
   added: (rover_is_charged greenrock roverobot) (clear emp l2)
   goals met: 0 of 3
7. (move_to_other_location roverobot l2 l4)
   deleted: (at roverobot l2)
   added: (move l2 l4) (at roverobot l4)
   goals met: 0 of 3
8. (move_to_other_location roverobot l4 l5)
   deleted: (at roverobot l4)
   added: (move l4 l5) (at roverobot l5)
   goals met: 1 of 3
9. (mineral_discharge roverobot l5 l4 greenrock lab1)
   deleted: (rover_is_charged greenrock roverobot)
   added: (there_a_mineral greenrock l5)
   goals met: 2 of 3
10. (mineral_discharge roverobot l5 l4 yellowrock lab1)
   deleted: (rover_is_charged yellowrock roverobot)
   added: (there_a_mineral yellowrock l5)
   goals met: 3 of 3
